In [1]:
import pandas as pd

In [3]:
friend_dict_list = [{'name': 'John', 'age': 15, 'job': 'student'},
                   {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                   {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = {'name', 'age', 'job'})

In [5]:
df.head()

    name        job  age
0   John    student   15
1  Jenny  developer   30
2   Nate    teacher   30

In [6]:
df['salary'] = 0

In [8]:
df.head()

    name        job  age  salary
0   John    student   15       0
1  Jenny  developer   30       0
2   Nate    teacher   30       0

In [9]:
import numpy as np

In [10]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [11]:
df.head()

    name        job  age salary
0   John    student   15     no
1  Jenny  developer   30    yes
2   Nate    teacher   30    yes

In [20]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
                   {'name': 'Jenny', 'midterm': 85, 'final': 80},
                   {'name': 'Nate', 'midterm': 30, 'final': 10}]
df = pd.DataFrame(friend_dict_list, columns = {'name', 'midterm', 'final'})

In [21]:
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10

In [22]:
df['total'] = df['midterm'] + df['final']

In [23]:
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [24]:
df['average'] = df['total'] / 2

In [25]:
df.head()

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [27]:
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')
        
df['grade'] = grades

In [28]:
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [29]:
def pass_or_fail(row):
    if row != 'F':
        return "Pass"
    else:
        return "Fail"

In [30]:
df.grade = df.grade.apply(pass_or_fail)

In [31]:
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [32]:
date_list = [
    {
        'yyyy-mm-dd' : '2000-06-27'
    },
    {
        'yyyy-mm-dd' : '2007-10-27'
    }
]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

In [33]:
df.head()

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [34]:
def extract_year(row):
    return row.split('-')[0]

In [35]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [36]:
df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [42]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
                   {'name': 'Jenny', 'midterm': 85, 'final': 80},
                   {'name': 'Nate', 'midterm': 30, 'final': 10}]
df = pd.DataFrame(friend_dict_list, columns = {'name', 'midterm', 'final'})

In [43]:
df.head()

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10

In [44]:
df2 = pd.DataFrame([
    ['Ben', 50, 50]
], columns=['name', 'midterm', 'final'])

In [45]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [46]:
df.append(df2, ignore_index=True)

/var/folders/f2/7b9s_xgn3cv40p3qhtn7xs840000gn/T/ipykernel_1987/26416246.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True)

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     50